#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "448e2b647a26ade3d72a31091cf3856c" -> "4c188b2c7144d668b4fc62b1902e9fbe"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "a303848132695df8f36330b8b33333d3" -> "10316b26cdddfd77d83966b91410ccd6"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "02d6eb3ac5425cf8ea156e056712bcec" -> "49387d8f2120f24474038ba86f662fed"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "f108c2fa6cec46c701427924ccc87793" -> "e9cddb97bc6f22c5b6277063231ae56e"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "db796517f3bb0b39a2cc3f31901dda3f" -> "cc3d22fb24b944a579f4088d6b1a6e9e"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "20148e9792af1b47827fb20281a95c85" -> "9820e416f54b5ef87c0125b43a1b0c43"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "f2b2953b02fcc285913447083182c871" -> "71f7e1f583d9c09b86ac46ef872503e8"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "89bfddd20f4a1a5b30541a47e0441781" -> "291b817d9c48a518639ae6a4373bf9e5"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "5319c5d0db60a4869fef9239a636b63e" -> "d20dbb9d6e606e35034c003ffbf6a07f"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "c640664b9a963a74219b53b26648c55b" -> "146810c26a4e1f7b2583d587858ed2ab"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "216ce8f64edac5031e9668b4a66ccfa9" -> "4b0e6514345b7bd49e9761b0498f0b18"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "b11ef3f9e87c280818fe2ad4d2b72f97" -> "e231a190abd447bf153175b4489d07a9"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "a77e2f1e327b7a35241f6319d5164d2c" -> "6e50d58f0dee0f7c360ea57a97d0ba27"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "c3e8e84623cbfa3e323dd369ceb3aa1e" -> "d58c1e32d35e734f8d498f1cd0516a01"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "fa87849bd4a2afa276b3de12b45e7a9d" -> "4dae962c6590ab3247275b983d26a603"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "9b47fadb013b3074fe85fc02fc7e6dc5" -> "003814c4c5882e930be6cb2f2d0a4fd4"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "075110e8918873d25ab7631a0dfbb680" -> "1d8355ea3c0359c6a4a72ee0cf5295d9"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "f0795152ae579154554ea9482c635839" -> "d6ecbf539dc2a0ef1edc6f04e64489f6"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "9942c5a98a48bc9dd9ff1054deab37fb" -> "38f5574ab936d4e09602606bbd759f16"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "5665f585e0bd9cf2b94dfc818a46f8a5" -> "a1f2a94b706f50e27dc3213626e14da5"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "8fb308cc40d9c35519eae34f6c0ba3ba" -> "0d38711644fdaa5d66c9d9b7d839e377"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "7a7cd5db74ea8b5cc82ea4bc6e837016" -> "f750be3386b6c88f038828e96d3c6de1"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "3e2f1145f96aadc2f7ea61435b3bf9df" -> "04442529536518fe085949515bd9da58"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "5379b86439a807143e735c8a194f7d71" -> "d4456973e829e0f6d243e16f20d60370"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "444d13d93fe6c0efbe114c88da47042d" -> "8f4098ffacacab95e8a99b1a13989021"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "1b0e2b2ad5b4eac0780de76487dce626" -> "08ac681cfdd416a1fb308ee28f547721"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "e9f3cd04f7e1b9441e181a3460c8ed0a" -> "d0e4550772f5136a9133950c13a52b28"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "5aca3dd060901f0a79ebf704d181042e" -> "8f0de4c5a338568a41fd44bfff5116ac"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "57ef1c09b7a28b37a0fd989f8854528d" -> "ce2b235b9e7bb5719c8cd2d7bceddc4f"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "385bed8a5838423a346c41e7179c2c0d" -> "157e6f7bd612d1a05f1ee375fa645186"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "9fd157114eeb391a25af06295ecfc506" -> "b42cb21810bdd31bbf17f4c023d37a7b"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "278ae57f62452ed81fc6721e0d88e6bb" -> "6c577b5b5eb118cb9610ccc9f2e62f0c"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "893c22679d966571943e0ddb0be7abc9" -> "8b372539a97589c311cce738d7af7c8f"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "324bedf7cbf3d5093f6c7598ca31e34a" -> "f3431d1433651614a8b34811d1f1d59a"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "16bb901245d09c940245a5761b59b3dc" -> "2be453ab0b894e2640cb69c80977bd4e"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "a4ec2b466b4f96779a0f7a400f0380da" -> "b098c75495045d876fa8aa3a8ef58c59"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "afd5ebd1e3a09a7953c95fa0ad4f7319" -> "79f44f30050733f405bd51a9fb3cb35a"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "441c11724293d80d1ea0c7043e676a1a" -> "d50ae9e74570b54d9c3bddf4791b3a08"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "5c9c7f8b1fc53597bd60734c1d333ac7" -> "e5c2090dd1bb77a31f6aae751ef448b2"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "53ca17ff831da09bfbf5b664951a523a" -> "6117589b6b21ddb68be9aba101dc0b84"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "e9f23b5bac31edb860f59c39cee29111" -> "ed5ff5b279d7ea156f08a0647965fe49"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "26f14f9b234e288d318f41e3fcef5c31" -> "4a9a1455fdf0db316d54e3f50407f46e"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "58295533e114045695b529c228f676e9" -> "35046014c62a57d2ca40abf88250d878"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "502f71e136ad9880dc8fab2b5a8e88a8" -> "b9f7b8c0b1ea1727abf1f1a51b25ce3f"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "8c91a38cac7b064b8893e2ac9a673977" -> "94bf3200a2908dcfe7205ad192758d94"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "139LboloGZIVHuVchzwQ/vkG7Cg/HIHFyW1npvtjTOs=" -> "+8zklbI4TwQqxynppRG0A+7wtlOgDuB/4erGipiP6ZQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:46.000+0000" -> (known after apply)
      ~ source_code_hash               = "ML6EqWG2rxLtBdImr5ZDVo6X0AYw5MjQLUToF7qE5Yg=" -> "lLW3IW+Ka+4IJBf+1puKyJ6fHm9kYnTzDBXSSB7ZeDk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "67zHgmYfvH62iEQveQ4FNiMh6anJ2dO7EOk/9uFlp08=" -> "Ool/EWshoV4L4ESKnN2XvZHiNDJuV20TVVi1WlwZGuk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "m6Sm/trHPTokAZbsaNL98o8BkdNMi4SaFW0ousWkGx4=" -> "N9K9xb1Kn5vJEwG1Dyn2tri7Nf2qIuU6j2l5tZVe2bI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "IEf7BhQlp5ZJURsBTAZSia+VgZzKnOq/dGDJv/wqw7Q=" -> "iH/u/0nhIPf6MGezKkwsdY2uUk54oNXgIIv/Tf2k8iM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:39.000+0000" -> (known after apply)
      ~ source_code_hash               = "lfQGN1HA8SBuM5/0f1GlxacsUcR9nrE9Q7dauXQf68o=" -> "hGjLHmxAQ0/U1rucgQu6cdgaI30GoNKGf54HyaRxN/4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "aPPo6r/T3V9/FTKQ4bBpssUREY86L2lNvcLh2vaERcY=" -> "JgG0fuMhZ01MfOIeAHeR/93Q9jCO3uKs4isvcLIN5+E="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "jJvpjkgXJTNU0bgCmBiq1rlnrS31uKYfO2ySmlrCb/8=" -> "njzBKZv8gyhXQ47aoGGj7l3hOHdDr0odfzuSHBa5FoU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "P5FTQJyXBsnn1RigT8yifv4l3uLlrV8X5Tz0ie12lnU=" -> "Pdz5w4zcVm3FPXV3sEUp04ZVZA4ErOKUcd9KVbNkOio="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "zr//wfz2is3iXnef+E7KtjlGAnDH0I4mrVc0Mr0Pz44=" -> "Gpro972a5j+DQANmM2RbK/qlATWvrWJoIyOzvAryvWQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "tLhp1pk4T2bqIVHq8wLZjcuPs2KYBBu5011StIGaFNw=" -> "nUZu68ZCPHYMUBnIWFH5bEV2erRz6fwszYk5lluSawg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:01.000+0000" -> (known after apply)
      ~ source_code_hash               = "DPEusTxBYm0/sMQw0KfiIsx0c4imieq1rM9K05/oxeE=" -> "qE9U1Zc8uKkyMx/6FIzWkU3KAWOOD0H6pojCnBb051w="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "CqORXONbeW3ycINK+iNoc4IznMi+6Tf25Egzq1e7DhA=" -> "Thj/adB7ALwHI/6PpklUuvP5/xfZrLIJeXeaBBw81TU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:57.000+0000" -> (known after apply)
      ~ source_code_hash               = "09m1b2MgFJ06KyzIaC/LmXz4R1RUyVNz5Az6+YmvMD0=" -> "evY9/RI3f3+ecUGTDPV7tisGer+7UA9XVuZO8QwE6kk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "dNlz6CLNBj4gS8yXo0Zp/V8QWFWuHA1vCMX0YxPq8nE=" -> "EQ2Q1Xf020Z6XZd7gBDfERcykJ24kx6rn3mDwGyseNM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "5/IBKXBBRvdoZYAz6qsApHd+rpjsE2CBp1/pkGeXV08=" -> "JOEOr4x4ai2vQvMb+gAaSiIN9MFxAzd8gdKb3p3dqSk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "W2BPFimgPcle6FU9piAWlARV/kB8XhWdBZKxoJTKDQ0=" -> "uWlzNrcqsKpYiYndz4j/AMyPlXj+pQoh9I2jD4wpMi4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "cG+mqEUu2q8wwwQyGogKykhltuIKB6C7Jy8F9RC920Q=" -> "xMiWdBMJ+rUn/G79F7arm/Y+ABMduAkApB1OVpV4Vdg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "gcMH3+M5w4O3idQwNBQPB9+p19rNlg/HfN1hphCtLxE=" -> "ywZwuYe8UFa0lgRGQ+UIJfadbUmz5udh6hw6NevHp0I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "l+ShIYZtn/2ejoLfnf0rsaVKkv73RyPqKrIZzvEgY+I=" -> "V9ZDWlOqlPI48JApRg9zPIII4LD9BposuT/59v/t0QE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "JfSwym73YkpyU+AfYIfL8Ann7Tqt9+J9Gdt+D1DMB58=" -> "WFIu5WXIrUoSotSFNIA49m6NvdxvQeBh3xxMyXgzt1U="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "KhueoGP5CCuPCfGgq5NbG75L6SSQJQBYMbDYxpz2DYo=" -> "fkoSRty7rayZInnoPFqdy4alipVOqnLCjDIQu2vB/iY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlPJbff1K7EbLU5KNqGWrhvrxaishY0ovU4P8gilIzE=" -> "SBLRMy9C2JwdRf0yLELnpIbydGK/6aDjOkeLyV8PAHI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:41.000+0000" -> (known after apply)
      ~ source_code_hash               = "0uVXlnBNH9V6c/Nfq5n/IOgDbatcIZJ7kmJmx8uJL88=" -> "gLECD5sUnQ4+MmI3g87qj1/695OCUvgJh/6T8SQpum4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "P4aSC7lz0pevAFGp+uDQrg1d0FLCMJd8pfMSk6L7hPw=" -> "hTfH0mL1yr5FIpjYW8fhgJZof2hwDpsMHMtuG4O0s+k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:52.000+0000" -> (known after apply)
      ~ source_code_hash               = "lIA58UYcQn3O8Oo8MDT4IRj0J2iv9t5Nb64nRYGkUCc=" -> "L30rqbdAFjBzk78p6fwKDYUuHP+t2z6v9tT79mrr9iQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "m2F33mFFz+rnPyL0GUVcf3CLIlf5U6WuumbMzF8WSVE=" -> "xkSDfvbKqhd476O/BloUaJRJYALafn2JIUN2R8vQbR4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "m7cNqzKhzJHNg8th9wSOhhWEYcwxql30Z3yaGoYT2fE=" -> "dIS1a07nyeOcm+qIBWflT1AcGNzyKSb4rl9vdZ+Bg74="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "JCLWpKM50/XQIkwmJG67GX8qCFLO93MPZ3gv7gEZ9+o=" -> "sZHHDTxNDoUom7MFRUIx34Gjt46Z7rCuxS3BLvsjHFc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:50.000+0000" -> (known after apply)
      ~ source_code_hash               = "KV6SrIKJcwn+nHU+5Kzp9QXS6CqLHv7qmYvWfF0FO5g=" -> "Cwu0XSYS9T6PARQhJFiu/XGxyJy71+c32A9Kju+G55I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "ITztasm036d3VV06ltFmWdYvblyOhHkqvFLbtCtqAlY=" -> "iGyrF/kfjz4NOQfKmOASMqFzXfng/uyR1bBAkWCbgew="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "wIP4kTfwVDRrNHNW4wj3Vx8Zc9//6EvtvflAqdeN8DI=" -> "YwU7jdXt483LdpM24TSeL3zPx+YipY5IvLhpdeEPsDM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2022-12-02T19:07:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "sbqHY0DPa/Yx4QVe1PG7lakx2T+Z3aCbV3F7Ugysd5A=" -> "DUKBiiah+DWarfQg60t/GzZBT8PyucaLjMPJ2nTw/sI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "1xCNRGYbXMEH1mdBQx4KZensBQguD9hKLBtbZW7TxhI=" -> "1NGpob9trS4Vn1FEYh1+pD35uAIOeehbnUGerkfVV7Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "/X2VytJJzg8zrOizLFYwO8Kj/ysH2n5cw/UVD/yvV/4=" -> "I0UktAZrdwYksHczXJwnOfifNq/MNXapoyilOouF4ww="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "4JyzSCc+mGbhwOcG6cR2ZrMbGumVY4/zrU0SRrRekMo=" -> "BmiMX9VHdOd0/MDbzHjNGpoD0+kXNUNqAJiSuNRcYmc="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "IS7mtRwixMpOHzGLQG3JmZgzp9W2oQI7XE12vNGJJO0=" -> "Bd7sQ0xY0SR25gh6OjqV/FKgPGWUy07dmLYjhIzSQWQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "fnbY8OKAQ+1TPqKOMBjYKMPdyOHwbiGsdYCtUPNUeGE=" -> "+cuuyea30bK5YiujedGjY7U+NMvCAFmMkTRH566lN1M="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:03.000+0000" -> (known after apply)
      ~ source_code_hash               = "mVwhIm3LJvBJov1DsMbbqAbw4riYpXnwQoF0w9S/YsU=" -> "wUXbDz6k+RVF/2M5ZXh81quq6loc8946MxogkmmxqbA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "XTPkPzJ+6I9zundN0EaQgRyOPzFqwnsbiNo5BU4HLfU=" -> "3CV++wEWgQicPhjxMG8f/RiFirN2X02Mhw4P3jl9bkU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "8cFh9AJP5uaeZbuTFpDuZf14n7/xwNi31VszDQ4tFAU=" -> "7K0DRVsaDjw2BRMuDpHdQf45FSDeXRuIyBkyjlVG5b0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:23.000+0000" -> (known after apply)
      ~ source_code_hash               = "H//1MavS3AHgUga7zWzYcRDNHkYPMT6wpPMqtCr6juM=" -> "6npeD4n38ihecABqRaCwiJM4DEqYKsdf6K3zqacaCJg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2022-12-01T20:44:02.000+0000" -> (known after apply)
      ~ source_code_hash               = "3xn9F4gqdaGcauXSbxc09PF28UItfgdwSGuJsUn88RY=" -> "jcRGU6ro7RZlk2ltp3pbXU/Tb2cHJFT7X0XIrnt9wNI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2022-12-01T20:43:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "AlXkcwdp2UzQi6AqvK94ux1/4TiS1yu+ZE4s/tpjF7o=" -> "vF9QdbODlsV3ZM5a2V/QcztUFca9T4ONacM4gHBJJYE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2022-12-01T20:43:20Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "7h2ws0" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2022-12-01T20:43:19Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2022-12-01T20:43:20Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 91 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*